'''
Задача 1.

Користувач вводить ціле число n і видаляє одну цифру числа так, щоб
число що утворилось, було максимально можливим. Наприклад, якщо число,
яке ввели 432, то необхідно видалити цифру 2, яка стоїть на 3 місці,
щоб отримати максимально можливе число 43. Напишіть програму, яка знайде
максимально можливе число, яке можна отримати після видалення однієї цифри.

Автор: Новосад Сніжана
'''

# Зчитуємо введене користувачем число
user_input = input("Введіть ціле число: ")

max_value = 0

# Проходимося по всім цифрам числа та знаходимо ту, яку можна видалити
for i in range(len(user_input)):
    current_num = int(user_input[:i] + user_input[i+1:])
    max_value = max(max_value, current_num)

# Виводимо максимально можливе число після видалення однієї цифри
print(f"Максимально можливе число після видалення однієї цифри: {max_value}")

