'''
Задача 1.

Користувач вводить ціле число n і видаляє одну цифру числа так, щоб
число що утворилось, було максимально можливим. Наприклад, якщо число,
яке ввели 432, то необхідно видалити цифру 2, яка стоїть на 3 місці,
щоб отримати максимально можливе число 43. Напишіть програму, яка знайде
максимально можливе число, яке можна отримати після видалення однієї цифри.

Автор: Новосад Сніжана
'''

# Зчитуємо введене користувачем число
user_input = int(input("Введіть ціле число: "))

# Перетворюємо введене число в рядок для зручності операцій
num_str = str(user_input)

# Ініціалізуємо максимальне значення та індекс цифри, яку потрібно видалити
max_value = float('-inf')
index_to_remove = None

# Проходимося по всіх цифрах числа та знаходимо ту, яку можна видалити
for i in range(len(num_str)):
    current_num = int(num_str[:i] + num_str[i+1:])
    if current_num > max_value:
        max_value = current_num
        index_to_remove = i

# Виводимо максимально можливе число після видалення однієї цифри
print(f"Максимально можливе число після видалення однієї цифри: {max_value}")
